{
    "intro": [
        {
            "Who am I?": [
                "Hi! How are you? That wasn't rhetorical... Sorry, where are my manners? Let us start over. My name is Muhammad Gill",
                " and I am a 21 year old living in Ontario, Canada. You are currently browsing my small CV website.",
                "Let’s talk about you - according to my learning algorithm, there is about a 68% chance that you are a recruiter,",
                "and a 23% chance that you are one of my peers (based on metrics such as recruiting season). regardless of who you are, welcome!"
            ]
        },
        {
            "So what do you do for a living...?": [
                "Is this not a bad question to start with? What if their not particularly proud of their work? Now you are stuck.",
                "You can try: That’s a really amazing job! But that could just get you into more trouble... Anyway back on topic, I like to call",
                "myself a Software Engineer. I enjoy delving into the development of deep learning models, web services, automation macros,",
                "and all sorts of backend systems for money (as a freelancer). Oh, and a little bit of mobile and web development ",
                "(as you can see, my front-end skills are not the best). So yeah, there’s a high chance that I am a qualified candidate -",
                "qualified candidate for what? That is for you to decide."
            ]
        },
        {
            "Want to learn more about my skills?": "Navigate to my experience or education pages (using the Navigator in the corner)!"
        }
    ],
    "skills": [
        {
            "Operating Systems": "Linux (Debian/Ubuntu), macOS, Windows"
        },
        {
            "Languages": "C++, Python, Java, SQL, Bash, Javascript, CSS, HTML"
        },
        {
            "Technologies": "Tensorflow, scikit-learn, Pytorch, kubernetes, .NET, Node.js, ASP.NET, MATLAB, Express.js"
        },
        {
            "Tools": "Git, XCode, Visual Studio, Eclipse, VS Code, Azure, mySQL, mariaDB, MongoDB, AWS"
        }
    ],
    "experience (Most Recent 3)": [
        {
            "organization": "Google",
            "period": "September 2019 - December 2019",
            "position": "Machine Learning Engineer",
            "location": "Mountain View, California, USA",
            "description": [
                "Pretrained a BERT encoder (tensorflow) on large volumes of english text using cutting edge parallel TPU technology and kubernetes to achieve over 95% accuracy on dataset sequences.",
                "Optimized database queries (SQL) to run on Googles parallel query engine, reducing runtime by over 80%.",
                "Modified a BERT transformer architecture (python, tensorflow) to be used with an MLP in order to classify text post-encoding, increasing base classification accuracy by over 6%.",
                "Achieved state-of-the-art precision (tensorflow model) classifying wikipedia text, using a modified transformer model.",
                "Wrote a parallel data processing pipeline (c++) to generate text datasets to be used for training almost any Ontology classification model.",
                "Authored a research paper (publication): Text Object Ontology, in which I present state of the art results in Ontological Text Classfication."
            ]
        },
        {
            "organization": "Google",
            "period": "January 2019 - April 2019",
            "position": "Software Developer",
            "location": "Montreal, Quebec, Canada",
            "description": [
                "Wrote, and deployed (using kubernetes) a parallel label propagation algorithm (c++) to label unlabelled data samples, increasing algorithm runtime speed by 1800%, over single machine speed.",
                "Independently designed and implemented semisupervised learning pipeline (cpp) for very large security datasets. Initial, unoptimized models realized accuracy and F1 scores above 98%.",
                "Wrote custom evaluation binary (python, cpp, javascript) to score the semi-supervised and unsupervised models, saving 100s of manual hours.",
                "Wrote a custom node transformation binary (c++, python) to generate new datasets capabale of key-shifting to create 30+ unique label datasets."
            ]
        },
        {
            "organization": "Blackberry LTD",
            "period": "May 2018 - August 2018",
            "position": "Software Developer",
            "location": "Waterloo, Ontario, Canada",
            "description": [
                "Developed deep learning model for relational database syntax conversion from PL/SQL (oracle) to mySQL (100% precision).",
                "Developed and optimized dynamic scripts (Java) to efficiently and securely migrate over 20% of company databases (schema, procedures and data) between different, incompatible platforms.",
                "Customized, optimized an open source mySQL DB (mariaDB) to increase database insert speed by 12%.",
                "Contributed greatly to many other confidential projects (java, javascript, HTML), currently being deployed to millions globally."
            ]
        },
        {
            "organization": "Personal Projects",
            "period": "Feb 2011 - Present",
            "position": "Software Developer",
            "location": "",
            "description": [
                "Wrote a model (python) to accurately predict stock price volatility using financial derivative (options) flow having over 82% 3-day accuracy.",
                "Independently developed (c++) 3200+ elo chess engine (neural network). Trained using self generated dataset (90+ million unique chess positions)."
            ]
        }
    ],
    "info": {
        "name": "Muhammad Gill",
        "personal_web": "http://mugill.com",
        "github": "https://github.com/mhgill",
        "linkedin": "https://www.linkedin.com/in/mhgill",
        "email": "mhgill@uwaterloo.ca",
        "phone": " "
    },
    "education": {
        "institute": "University of Waterloo",
        "institute_location": "Waterloo, ON",
        "degree": "Computer Engineering (Bachelors)",
        "study_period": "September 2016 - April 2021"
    }
}